bin/app/views/restaurants/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" IN (18, 19, 20, 21, 22)
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 18]]
---
			<td><%= restaurant.address %></td>
			<td><%= restaurant.reviews.length %></td>