bin/app/views/restaurants/show.html.erb

<h2>Reviews</h2>
	<% @restaurant.reviews.order(created_at: :desc).each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  ORDER BY "reviews"."created_at" DESC  [["restaurant_id", 25]]