app/controllers/restaurants_controller.rb

	def create
		@restaurant = Restaurant.new(params.require(:restaurant).permit(:name, :address, :phone))
		@restaurant.save
---
INSERT INTO "restaurants" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-02-03 17:12:10.542805"], ["updated_at", "2015-02-03 17:12:10.542805"]]

	def show
		@restaurant = Restaurant.find(params[:id])
		@review = Review.new
		@users = User.all
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]
SELECT "users".* FROM "users"