bin/app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("user_id", "comment", "rating", "recommendation", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 12], ["comment", "great!"], ["rating", 4], ["recommendation", "t"], ["restaurant_id", 18], ["created_at", "2015-02-05 15:11:27.139051"], ["updated_at", "2015-02-05 15:11:27.139051"]]
---
	def create
		@restaurant = Restaurant.find(params[:restaurant_id])
		@review = @restaurant.reviews.create(params_include_user_id)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ? AND "reviews"."id" = ? LIMIT 1  [["restaurant_id", 5], ["id", 4]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 4]]
---
	 def destroy
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.reviews.find(params[:id])
    @review.destroy