bin/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "user_1@example.com"]]
---
	def create
		params[:email]
		user = User.where(email: params[:email]).first