bin/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "Jaydon01"], ["name", "peterortiz@gmail.com"], ["created_at", "2015-02-05 17:23:25.892600"], ["updated_at", "2015-02-05 17:23:25.892600"]]
---
	def create
		@user = User.create(user_params)